//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Este executată etapa %d din %d: crearea întregii relatări";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Este executată etapa %d din %d: crearea bazei de date bootstrap";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Este executată etapa %d din %d: crearea bazei de date coadă de așteptare cerere";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Este executată etapa %d din %d: descărcarea întregii relatări. %s din %s intrate până în acest moment.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Este executată etapa %d din %d: ștergerea cererilor expirate";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Este executată etapa %d din %d: încărcarea metadatelor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Este executată etapa %d din %d: executarea concatenării cozilor de așteptare cerere";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Este executată etapa %d din %d: executarea concatenării tranzacțiilor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Este executată etapa %d din %d: executarea concatenării de ștergeri creare";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Este executată etapa %d din %d: prelucrarea query-urilor de definire %s via %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Este executată etapa %d din %d: prelucrarea cererilor. Sunt expediate %s din %s cereri de modificare.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Este executată etapa %d din %d: reaplicarea modificărilor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Este executată etapa %d din %d: analizarea datelor intrate";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Este executată etapa %d din %d: intrarea datelor de la server. %s intrate până în acest moment.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Este executată etapa %d din %d: eliminarea relațiilor șterse";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Este executată etapa %d din %d: eliminarea cererilor specificate pentru Eliminare după încărcare";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Este executată etapa %d din %d: expedierea datelor la server. %s expediate până în acest moment.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Este executată etapa %d din %d: expedierea bazei de date de relatări entitate. %s din %s expediate până în acest moment.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Este executată etapa %d din %d: expedierea bazei de date de query-uri cerere. %s din %s expediate până în acest moment.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Este executată etapa %d din %d: lansarea comunicării cu serverul";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Este executată etapa %d din %d: prelucrarea preliminară a cererilor înainte de încărcare";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Este executată etapa %d din %d: așteptarea descărcării";

